#####################
# Apartado 1. Cotas #
#####################

gap> uboundhamming := UpperBoundHamming(63,5,2);
4572817073304301

gap> Log2(Float(uboundhamming));
52.022

################################

gap> lboundgilbert := LowerBoundGilbertVarshamov(63,5,2);
140737488355328

gap> Log2(Float(lboundgilbert));
47.

################################

gap> uboundsingleton := UpperBoundSingleton(63,5,2);
576460752303423488

gap> Log2(Float(uboundsingleton));
59.

#################################

gap> uboundplotkin := UpperBoundPlotkin(63,5,2);
180143985094819840

gap> Log2(Float(uboundplotkin));
57.3219

################################
# Apartado 2. Codigos lineales #
################################

gap> G:= [[1,0,2,0,1],[2,2,1,1,1]];
[ [ 1, 0, 2, 0, 1 ], [ 2, 2, 1, 1, 1 ] ]

gap> C2 := GeneratorMatCode(G, GF(3));
a linear [5,2,1..3]2..3 code defined by generator matrix over GF(3)

###############################

gap> M := MinimumDistance(C1);
3

gap> C := (M-1)/2;
1

##############################

gap> Check := CheckMat(C2);
[ [ Z(3)^0, 0*Z(3), Z(3)^0, 0*Z(3), 0*Z(3) ], 
  [ 0*Z(3), Z(3)^0, 0*Z(3), Z(3)^0, 0*Z(3) ], 
  [ Z(3), Z(3), 0*Z(3), 0*Z(3), Z(3)^0 ] ]

gap> Codeword(Check);
[ [ 1 0 1 0 0 ], [ 0 1 0 1 0 ], [ 2 2 0 0 1 ] ]

##############################

gap> SyndromeTable(C2);
[ [ [ 0 0 0 0 0 ], [ 0 0 0 ] ], [ [ 0 0 0 0 1 ], [ 0 0 1 ] ], 
  [ [ 0 0 0 0 2 ], [ 0 0 2 ] ], [ [ 0 0 0 1 0 ], [ 0 1 0 ] ], 
  [ [ 0 0 0 1 1 ], [ 0 1 1 ] ], [ [ 0 1 0 0 0 ], [ 0 1 2 ] ], 
  [ [ 0 0 0 2 0 ], [ 0 2 0 ] ], [ [ 0 2 0 0 0 ], [ 0 2 1 ] ], 
  [ [ 0 0 0 2 2 ], [ 0 2 2 ] ], [ [ 0 0 1 0 0 ], [ 1 0 0 ] ], 
  [ [ 0 0 1 0 1 ], [ 1 0 1 ] ], [ [ 1 0 0 0 0 ], [ 1 0 2 ] ], 
  [ [ 0 0 1 1 0 ], [ 1 1 0 ] ], [ [ 1 1 0 0 0 ], [ 1 1 1 ] ], 
  [ [ 0 1 1 0 0 ], [ 1 1 2 ] ], [ [ 0 0 1 2 0 ], [ 1 2 0 ] ], 
  [ [ 0 2 1 0 0 ], [ 1 2 1 ] ], [ [ 1 0 0 2 0 ], [ 1 2 2 ] ], 
  [ [ 0 0 2 0 0 ], [ 2 0 0 ] ], [ [ 2 0 0 0 0 ], [ 2 0 1 ] ], 
  [ [ 0 0 2 0 2 ], [ 2 0 2 ] ], [ [ 0 0 2 1 0 ], [ 2 1 0 ] ], 
  [ [ 2 0 0 1 0 ], [ 2 1 1 ] ], [ [ 0 1 2 0 0 ], [ 2 1 2 ] ], 
  [ [ 0 0 2 2 0 ], [ 2 2 0 ] ], [ [ 0 2 2 0 0 ], [ 2 2 1 ] ], 
  [ [ 2 2 0 0 0 ], [ 2 2 2 ] ] ]


#############################

gap> c := Codeword("12212");
[ 1 2 2 1 2 ]

gap> c in C2;
false

gap> Syndrome(C2,c);
[ 0 0 2 ]

##############################

gap> c := Codeword("12202");
[ 1 2 2 0 2 ]

gap> c in C2;
false

gap> Syndrome(C2,c);
[ 0 2 2 ]
